SolderedElectronics/Dasduino-Board-Definitions-for-Arduino-IDE/Dasduino_megaTiny_core-2.1.0/boards.txt
#----------------------------------------#
# BOOTLOADING PARAMETERS                 #
#________________________________________#
lite.bootloader.WDTCFG=0x00
lite.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
lite.bootloader.OSCCFG=0x01
lite.bootloader.TCD0CFG_avrdude="-Ufuse4:w:0x00:m"
lite.bootloader.TCD0CFG_serialupdi=4:0x00
lite.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}00
lite.bootloader.APPEND=0x00
lite.bootloader.BOOTEND=0x02
lite.bootloader.avrdudestring=-Uflash:w:{runtime.platform.path}/bootloaders/hex/{bootloader.file}:i
lite.bootloader.serialupdistring=-f{runtime.platform.path}/bootloaders/hex/{bootloader.file} -a write
lite.bootloader.file=optiboot_txyz{bootloader.uartswap}{bootloader.entrycond}.hex
lite.bootloader.tool=avrdude

#----------------------------------------#
# Exported hex/lst/map names will        #
# indicate selected options. These       #
# are only to do that, nothing else      #
#________________________________________#
lite.build.printfabr=
lite.build.attachabr=
lite.build.wireabr=
lite.build.pwmabr=6
#lite.build.optabr=.Os

#----------------------------------------#
# UPLOAD VIA OPTIBOOT                    #
#________________________________________#
lite.upload.workaround=
lite.upload.tool=avrdude
lite.upload.protocol=arduino
lite.upload.prog_interlock="ERROR: Upload using programmer is not supported on optiboot boards"
lite.upload.extra_params=-D -P{serial.port}
lite.upload.speed=115200

#^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^#
# 14-pin Optiboot 0/1-series tinyAVR submenus #
#_____________________________________________#
# CHIP                                   #
#________________________________________#
lite.menu.chip.1604=ATtiny1604
lite.menu.chip.1604.build.board=AVR_ATtiny1604
lite.menu.chip.1604.build.attiny=1604
lite.menu.chip.1604.build.millistimer=A0
lite.menu.chip.1604.upload.maximum_size=15872
lite.menu.chip.1604.upload.maximum_data_size=1024
lite.menu.chip.1604.bootloader.TCD0CFG_avrdude=
lite.menu.chip.1604.bootloader.TCD0CFG_serialupdi=

lite.menu.chip.804=ATtiny804
lite.menu.chip.804.build.board=AVR_ATtiny804
lite.menu.chip.804.build.attiny=804
lite.menu.chip.804.build.millistimer=A0
lite.menu.chip.804.upload.maximum_size=7680
lite.menu.chip.804.build.mrelax=
lite.menu.chip.804.upload.maximum_data_size=512
lite.menu.chip.804.bootloader.TCD0CFG_avrdude=
lite.menu.chip.804.bootloader.TCD0CFG_serialupdi=

#----------------------------------------#
# CLOCK SOURCE                           #
#________________________________________#
lite.menu.clocko.20internal=20 MHz internal
lite.menu.clocko.16internal=16 MHz internal
lite.menu.clocko.10internal=10 MHz internal
lite.menu.clocko.8internal=8 MHz internal
lite.menu.clocko.5internal=5 MHz internal
lite.menu.clocko.4internal=4 MHz internal
lite.menu.clocko.2internal=2 MHz internal
lite.menu.clocko.1internal=1 MHz internal
lite.menu.clocko.20internaltuned=20 MHz internal - tuned
lite.menu.clocko.16internaltuned=16 MHz internal - tuned
lite.menu.clocko.12internaltuned=12 MHz internal - tuned
lite.menu.clocko.10internaltuned=10 MHz internal - tuned
lite.menu.clocko.8internaltuned=8 MHz internal - tuned
lite.menu.clocko.6internaltuned=6 MHz internal - tuned
lite.menu.clocko.5internaltuned=5 MHz internal - tuned
lite.menu.clocko.4internaltuned=4 MHz internal - tuned
lite.menu.clocko.2internaltuned=2 MHz internal - tuned
lite.menu.clocko.1internaltuned=1 MHz internal - tuned
lite.menu.clocko.20extclock=20 MHz external clock
lite.menu.clocko.16extclock=16 MHz external clock
lite.menu.clocko.12extclock=12 MHz external clock
lite.menu.clocko.10extclock=10 MHz external clock
lite.menu.clocko.8extclock=8 MHz external clock
lite.menu.clocko.24internaltuned=24 MHz internal - tuned, overclocked
lite.menu.clocko.25internaltuned=25 MHz internal - tuned, overclocked
lite.menu.clocko.30internaltuned=30 MHz internal - tuned, overclocked, may be unstable, req. 20 MHz fuse
lite.menu.clocko.32internaltuned=32 MHz internal - tuned, 2-series, overclocked, may be unstable, req. 20 MHz fuse
lite.menu.clocko.24extclock=24 MHz external clock - overclocked
lite.menu.clocko.25extclock=25 MHz external clock - overclocked
lite.menu.clocko.30extclock=30 MHz external clock - overclocked, may be unstable
lite.menu.clocko.32extclock=32 MHz external clock - overclocked, may be unstable
lite.menu.clocko.20internal.build.speed=20
lite.menu.clocko.20internal.build.clocksource=0
lite.menu.clocko.16internal.build.speed=16
lite.menu.clocko.16internal.build.clocksource=0
lite.menu.clocko.10internal.build.speed=10
lite.menu.clocko.10internal.build.clocksource=0
lite.menu.clocko.8internal.build.speed=8
lite.menu.clocko.8internal.build.clocksource=0
lite.menu.clocko.5internal.build.speed=5
lite.menu.clocko.5internal.build.clocksource=0
lite.menu.clocko.4internal.build.speed=4
lite.menu.clocko.4internal.build.clocksource=0
lite.menu.clocko.2internal.build.speed=2
lite.menu.clocko.2internal.build.clocksource=0
lite.menu.clocko.1internal.build.speed=1
lite.menu.clocko.1internal.build.clocksource=0
lite.menu.clocko.20extclock.build.speed=20
lite.menu.clocko.20extclock.build.clocksource=2
lite.menu.clocko.16extclock.build.speed=16
lite.menu.clocko.16extclock.build.clocksource=2
lite.menu.clocko.12extclock.build.speed=12
lite.menu.clocko.12extclock.build.clocksource=2
lite.menu.clocko.10extclock.build.speed=10
lite.menu.clocko.10extclock.build.clocksource=2
lite.menu.clocko.8extclock.build.speed=8
lite.menu.clocko.8extclock.build.clocksource=2
lite.menu.clocko.24extclock.build.speed=24
lite.menu.clocko.24extclock.build.clocksource=2
lite.menu.clocko.25extclock.build.speed=24
lite.menu.clocko.25extclock.build.clocksource=2
lite.menu.clocko.30extclock.build.speed=30
lite.menu.clocko.30extclock.build.clocksource=2
lite.menu.clocko.32extclock.build.speed=32
lite.menu.clocko.32extclock.build.clocksource=2
lite.menu.clocko.1internaltuned.build.speed=1
lite.menu.clocko.1internaltuned.build.clocksource=0
lite.menu.clocko.1internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
lite.menu.clocko.2internaltuned.build.speed=2
lite.menu.clocko.2internaltuned.build.clocksource=0
lite.menu.clocko.2internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
lite.menu.clocko.4internaltuned.build.speed=4
lite.menu.clocko.4internaltuned.build.clocksource=0
lite.menu.clocko.4internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
lite.menu.clocko.5internaltuned.build.speed=5
lite.menu.clocko.5internaltuned.build.clocksource=0
lite.menu.clocko.5internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
lite.menu.clocko.5internaltuned.bootloader.OSCCFG=0x02
lite.menu.clocko.6internaltuned.build.speed=6
lite.menu.clocko.6internaltuned.build.clocksource=0
lite.menu.clocko.6internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
lite.menu.clocko.8internaltuned.build.speed=8
lite.menu.clocko.8internaltuned.build.clocksource=0
lite.menu.clocko.8internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
lite.menu.clocko.10internaltuned.build.speed=10
lite.menu.clocko.10internaltuned.build.clocksource=0
lite.menu.clocko.10internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
lite.menu.clocko.10internaltuned.bootloader.OSCCFG=0x02
lite.menu.clocko.12internaltuned.build.speed=12
lite.menu.clocko.12internaltuned.build.clocksource=0
lite.menu.clocko.12internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
lite.menu.clocko.12internaltuned.bootloader.OSCCFG=0x02
lite.menu.clocko.16internaltuned.build.speed=16
lite.menu.clocko.16internaltuned.build.clocksource=0
lite.menu.clocko.16internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
lite.menu.clocko.20internaltuned.build.speed=20
lite.menu.clocko.20internaltuned.build.clocksource=0
lite.menu.clocko.20internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
lite.menu.clocko.20internaltuned.bootloader.OSCCFG=0x02
lite.menu.clocko.24internaltuned.build.speed=24
lite.menu.clocko.24internaltuned.build.clocksource=0
lite.menu.clocko.24internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
lite.menu.clocko.24internaltuned.bootloader.OSCCFG=0x02
lite.menu.clocko.25internaltuned.build.speed=25
lite.menu.clocko.25internaltuned.build.clocksource=0
lite.menu.clocko.25internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
lite.menu.clocko.25internaltuned.bootloader.OSCCFG=0x02
lite.menu.clocko.30internaltuned.build.speed=30
lite.menu.clocko.30internaltuned.build.clocksource=0
lite.menu.clocko.30internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
lite.menu.clocko.30internaltuned.bootloader.OSCCFG=0x02
lite.menu.clocko.32internaltuned.build.speed=32
lite.menu.clocko.32internaltuned.build.clocksource=0
lite.menu.clocko.32internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
lite.menu.clocko.32internaltuned.bootloader.OSCCFG=0x02
lite.menu.clocko.20internal.bootloader.OSCCFG=0x02
lite.menu.clocko.10internal.bootloader.OSCCFG=0x02
lite.menu.clocko.5internal.bootloader.OSCCFG=0x02

