SolderedElectronics/Dasduino-Board-Definitions-for-Arduino-IDE/Dasduino_megaTiny_core-2.1.0/boards.txt
#----------------------------------------#
# MILLIS TIMER                           #
#________________________________________#
lite.menu.millis.enabled=Enabled (default timer)
lite.menu.millis.disabled=Disabled (saves flash)
lite.menu.millis.timera=TCA0 (default on 0-series)
lite.menu.millis.timerd=TCD0 (1-series only, default there)
lite.menu.millis.timerb0=TCB0 (breaks tone() and Servo)
lite.menu.millis.timerb1=TCB1 (1614 only)
lite.menu.millis.rtc=RTC (no micros)
lite.menu.millis.rtcxtal=RTC w/w32.768 kHz ext. crystal (1-series only, no micros)
lite.menu.millis.rtcxosc=RTC w/w32.768 kHz ext. oscillator (1-series only, no micros)
lite.menu.millis.disabled.build.millistimer=NONE
lite.menu.millis.timera.build.millistimer=A0
lite.menu.millis.timerd.build.millistimer=D0
lite.menu.millis.timerb0.build.millistimer=B0
lite.menu.millis.timerb1.build.millistimer=B1
lite.menu.millis.rtc.build.millistimer=RTC
lite.menu.millis.rtcxtal.build.millistimer=RTC_XTAL
lite.menu.millis.rtcxosc.build.millistimer=RTC_XOSC

#----------------------------------------#
# BOD VOLTAGE                            #
#________________________________________#
lite.menu.bodvoltage.1v8=1.8V (5 MHz or less)
lite.menu.bodvoltage.2v6=2.6V (10 MHz or less)
lite.menu.bodvoltage.4v2=4.2V (20 MHZ or less)
lite.menu.bodvoltage.2v1=2.1V (Unofficial)
lite.menu.bodvoltage.2v9=2.9V (Unofficial)
lite.menu.bodvoltage.3v3=3.3V (Unofficial)
lite.menu.bodvoltage.3v7=3.7V (Unofficial)
lite.menu.bodvoltage.4v0=4.0V (Unofficial)
lite.menu.bodvoltage.1v8.bootloader.bodlevbits=000
lite.menu.bodvoltage.2v1.bootloader.bodlevbits=001
lite.menu.bodvoltage.2v6.bootloader.bodlevbits=010
lite.menu.bodvoltage.2v9.bootloader.bodlevbits=011
lite.menu.bodvoltage.3v3.bootloader.bodlevbits=100
lite.menu.bodvoltage.3v7.bootloader.bodlevbits=101
lite.menu.bodvoltage.4v0.bootloader.bodlevbits=110
lite.menu.bodvoltage.4v2.bootloader.bodlevbits=111

#----------------------------------------#
# BOD MODE                               #
#________________________________________#
lite.menu.bodmode.disabled=Disabled/Disabled
lite.menu.bodmode.enabled=Enabled/Enabled
lite.menu.bodmode.ensampfast=Enabled/Sampled (1 kHz)
lite.menu.bodmode.ensampslow=Enabled/Sampled (125 Hz)
lite.menu.bodmode.sampledfast=Sampled/Sampled (1 kHz)
lite.menu.bodmode.sampledslow=Sampled/Sampled (125 Hz)
lite.menu.bodmode.sampdisfast=Sampled/Disabled (1 kHz)
lite.menu.bodmode.sampdisslow=Sampled/Disabled (125 Hz)
lite.menu.bodmode.endisholdwake=Enabled hold wakeup/Disabled
lite.menu.bodmode.disabled.bootloader.BODCFG=0x00
lite.menu.bodmode.enabled.bootloader.bodmodebits=00101
lite.menu.bodmode.ensampfast.bootloader.bodmodebits=00110
lite.menu.bodmode.ensampslow.bootloader.bodmodebits=10110
lite.menu.bodmode.sampledfast.bootloader.bodmodebits=01010
lite.menu.bodmode.sampledlow.bootloader.bodmodebits=11010
lite.menu.bodmode.sampdisfast.bootloader.bodmodebits=01000
lite.menu.bodmode.sampdisslow.bootloader.bodmodebits=11000
lite.menu.bodmode.endisholdwake.bootloader.bodmodebits=01100

#----------------------------------------#
# BOOTLOADER UART PINS                   #
#________________________________________#
lite.menu.bootloaderuart.default=TX:5 (PB2), RX:4 (PB3)
lite.menu.bootloaderuart.alternate=TX:8 (PA1), RX:9 (PA2)
lite.menu.bootloaderuart.default.bootloader.uartswap=
lite.menu.bootloaderuart.alternate.bootloader.uartswap=_alt

#----------------------------------------#
#  UPDI and RESET PIN configuration and  #
#       OPTIBOOT ENTRY conditions        #
#----------------------------------------#
lite.menu.resetpinopti.reset=Reset, (default ptiboot for 1 sec. after ext. reset) *DANGER* HV UPDI programmer req'd for reprogramming!
lite.menu.resetpinopti.reset.bootloader.defaultentrycond=_extr
lite.menu.resetpinopti.reset.bootloader.resetpinbits=10
lite.menu.resetpinopti.UPDI=UPDI, (default optiboot for 8 sec. after all resets)
lite.menu.resetpinopti.UPDI.bootloader.defaultentrycond=_all8sec
lite.menu.resetpinopti.UPDI.bootloader.resetpinbits=01
lite.menu.resetpinopti.gpio=(weak) GPIO, (default optiboot for 8 sec. after all resets) *DANGER* HV programmer req'd for reprogramming! (PCHV)
lite.menu.resetpinopti.gpio.bootloader.defaultentrycond=_all8sec
lite.menu.resetpinopti.gpio.bootloader.resetpinbits=00

#----------------------------------------#
# BOOTLOADER Entry Conditions            #
#________________________________________#
lite.menu.entrycond.extronly=External reset only: 1 second timeout (assume autoreset, requires UPDI fused as reset)
lite.menu.entrycond.extr=External (reset pin): Reset pin and SW reset, 1 second timeout (assume autoreset, requires UPDI fused as reset).
lite.menu.entrycond.default=Default (Always enter bootloader 8 second delay - unless UPDI fused as reset, then extrf 1 second)
lite.menu.entrycond.all=Always: Every reset except a WDT reset or BOR w/out POR, 8 second timeout - easy to enter bootloader
lite.menu.entrycond.poronly= Power On Only: Only when chip is powercycled, 8 second timeout (assume manual unplug)
lite.menu.entrycond.swr=SW-only: 8 second timeout (Warning: bad app code won't run the bootloader)
lite.menu.entrycond.extr_slow=External (reset pin), slow: Reset pin and SW reset, 8 second timeout (assume manual reset, requires UPDI fused as reset)
lite.menu.entrycond.porswr=POR and SWR, but not external resets.
lite.menu.entrycond.default.bootloader.entrycond={bootloader.defaultentrycond}
lite.menu.entrycond.extr.bootloader.entrycond=_extr
lite.menu.entrycond.extronly.bootloader.entrycond=_extronly
lite.menu.entrycond.poronly.bootloader.entrycond=_poronly8sec
lite.menu.entrycond.all.bootloader.entrycond=_all8sec
lite.menu.entrycond.swr.bootloader.entrycond=_swronly8sec
lite.menu.entrycond.extr_slow.bootloader.entrycond=_extr8sec
lite.menu.entrycond.porswr.bootloader.entrycond=_porswr8sec

#----------------------------------------#
# STARTUP TIME (SUT)                     #
#________________________________________#
lite.menu.startuptimeopti.8=8ms
lite.menu.startuptimeopti.0=0ms
lite.menu.startuptimeopti.1=1ms
lite.menu.startuptimeopti.2=2ms
lite.menu.startuptimeopti.4=4ms
lite.menu.startuptimeopti.16=16ms
lite.menu.startuptimeopti.32=32ms
lite.menu.startuptimeopti.64=64ms
lite.menu.startuptimeopti.0.bootloader.SYSCFG1=0x00
lite.menu.startuptimeopti.1.bootloader.SYSCFG1=0x01
lite.menu.startuptimeopti.2.bootloader.SYSCFG1=0x02
lite.menu.startuptimeopti.4.bootloader.SYSCFG1=0x03
lite.menu.startuptimeopti.8.bootloader.SYSCFG1=0x04
lite.menu.startuptimeopti.16.bootloader.SYSCFG1=0x05
lite.menu.startuptimeopti.32.bootloader.SYSCFG1=0x06
lite.menu.startuptimeopti.64.bootloader.SYSCFG1=0x07

