SolderedElectronics/Dasduino-Board-Definitions-for-Arduino-IDE/Dasduino_megaTiny_core-2.1.0/boards.txt
#----------------------------------------#
# OPTIMIZATION OPTIONS                   #
#________________________________________#
#lite.menu.optimization.size=-Os (size)
#lite.menu.optimization.sizegcse=-Os (size, no GCSE)
#lite.menu.optimization.o3=-O3 (speed)
#lite.menu.optimization.o3gcse=-O3 (speed, no GCSE)
#lite.menu.optimization.size.build.optimizationlevel=-Os
#lite.menu.optimization.sizegcse.build.optimizationlevel=-Os
#lite.menu.optimization.o3.build.optimizationlevel=-O3
#lite.menu.optimization.o3gcse.build.optimizationlevel=-O3
#lite.menu.optimization.size.build.optabr=.Os
#lite.menu.optimization.sizegcse.build.optabr=.Osng
#lite.menu.optimization.o3.build.optabr=.O3
#lite.menu.optimization.o3gcse.build.optabr=.O3ng
#lite.menu.optimization.sizegcse.build.gcse=-fno-gcse
#lite.menu.optimization.o3gcse.build.gcse=-fno-gcse

#----------------------------------------#
# TWI OPTIONS                            #
#________________________________________#
lite.menu.wiremode.mors=Master or Slave (saves flash and RAM)
lite.menu.wiremode.mors.build.wire=MORS
lite.menu.wiremode.mands=Master and Slave
lite.menu.wiremode.mands.build.wire=MANDS

#----------------------------------------#
# printf() version options               #
#________________________________________#
lite.menu.printf.default=Default (doesn't print floats, 1.4k flash use)
lite.menu.printf.full=Full, 2.6k, prints floats
lite.menu.printf.full.build.printf=-Wl,-u,vfprintf -lprintf_flt
lite.menu.printf.full.build.printfabr=.pfF
lite.menu.printf.minimal=Minimal, 1.1k flash used
lite.menu.printf.minimal.build.printf=-Wl,-u,vfprintf -lprintf_min
lite.menu.printf.minimal.build.printfabr=.pfM

#----------------------------------------#
# PWM Pinning options                    #
#________________________________________#
lite.menu.PWMmux.default=PB0-2, PA3-5 (default)
lite.menu.PWMmux.D_buffered=PB0-2 (buffered), 1-series: PA4/5
lite.menu.PWMmux.buffered=PB0-2 (buffered). No TCD PWM even on 1-series.
lite.menu.PWMmux.I6=PB3-5, PA3-5.
lite.menu.PWMmux.I3_D=PB3-5 (buffered), 1-series: PA4/5
lite.menu.PWMmux.I3=PB3-5 (buffered). No TCD PWM even on 1-series.
lite.menu.PWMmux.D_buffered.build.pwmflags=-DUSE_TIMERD0_PWM -DTCD_USE_WOAB -DTCA_BUFFERED_3PIN
lite.menu.PWMmux.buffered.build.pwmflags=-DTCA_BUFFERED_3PIN
lite.menu.PWMmux.I6.build.pwmflags=-DTCA_PORTMUX=0x07
lite.menu.PWMmux.I3_D.build.pwmflags=-DTCA_PORTMUX=0x07 -DUSE_TIMERD0_PWM -DTCD_USE_WOAB -DTCA_BUFFERED_3PIN
lite.menu.PWMmux.I3.build.pwmflags=-DTCA_PORTMUX=0x07 -DTCA_BUFFERED_3PIN
lite.menu.PWMmux.default.build.pwmabr=6
lite.menu.PWMmux.D_buffered.build.pwmabr=3D
lite.menu.PWMmux.buffered.build.pwmabr=3
lite.menu.PWMmux.I6.build.pwmabr=I6
lite.menu.PWMmux.I3_D.build.pwmabr=I3D
lite.menu.PWMmux.I3.build.pwmabr=I3

#----------------------------------------#
# attachInterrupt Mode                   #
#________________________________________#
lite.menu.attach.allenabled=On all pins, with new implementation.
lite.menu.attach.allenabled.build.attachmode=-DCORE_ATTACH_ALL
lite.menu.attach.manual=Only enabled ports
lite.menu.attach.manual.build.attachmode=-DCORE_ATTACH_NONE
lite.menu.attach.oldversion=Old version, (may fix bugs)
lite.menu.attach.oldversion.build.attachmode=-DCORE_ATTACH_OLD
lite.menu.attach.manual.build.attachabr=.aMan
lite.menu.attach.oldversion.build.attachabr=.aOld

#########################################################

##########################################################################
#  Non-bootloader                                                        #
#                                #    #  #     ####   ###  #   #       ###
#  ATtiny3224/1614/1604         ##    #  #     #   #   #   ##  #     #####
#  ATtiny1624/814/804            #    #### === ####    #   # # #   #######
#  ATtiny824/414/404             #       #     #       #   #  ##     #####
#  ATtiny424/214/204            ###      #     #      ###  #   #       ###
#________________________________________________________________________#
#                                        #
# BUILD PARAMETERS                       #
#________________________________________#
easyc.build.text_section_start=.text=0x0
easyc.build.millistimer=D0
easyc.build.board=AVR_ATtinyxy4
easyc.build.clocksource=0
easyc.build.core=megatinycore
easyc.build.mrelax= -mrelax
easyc.build.variant=txy4
#easyc.build.optimizationlevel=-Os
easyc.build.gcse=
easyc.build.tuned=
easyc.build.printf=
easyc.build.wire=MORS
easyc.build.attachmode=-DCORE_ATTACH_ALL
easyc.build.mcu=attiny{build.attiny}
easyc.build.f_cpu={build.speed}000000L
easyc.build.extra_flags=-DARDUINO_attinyxy4 {build.tuned}
easyc.build.export_merged_output=false
easyc.build.pwmflags=

#----------------------------------------#
# BOOTLOADING PARAMETERS (FUSES)         #
#________________________________________#
easyc.bootloader.WDTCFG=0b{bootloader.wdtwindowbits}{bootloader.wdttimeoutbits}
easyc.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
easyc.bootloader.OSCCFG=0x01
easyc.bootloader.TCD0CFG_avrdude=
easyc.bootloader.TCD0CFG_serialupdi=
easyc.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}0{bootloader.eesavebit}
easyc.bootloader.APPEND=0x00
easyc.bootloader.BOOTEND=0x00
easyc.bootloader.resetpinbits=01
easyc.bootloader.avrdudestring=
easyc.bootloader.serialupdistring=-aerase
easyc.bootloader.tool=avrdude

#----------------------------------------#
# Exported hex/lst/map names will        #
# indicate selected options. These       #
# are only to do that, nothing else      #
#________________________________________#
easyc.build.bootload=
easyc.build.printfabr=
easyc.build.attachabr=
easyc.build.wireabr=
easyc.build.pwmabr=6
#easyc.build.optabr=.Os

#----------------------------------------#
# ALL UPLOADING VIA UPDI                 #
#________________________________________#
easyc.upload.tool=avrdude
easyc.upload.workaround=
easyc.upload.prog_interlock=

#^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^#
# 14-pin 0/1-series tinyAVR submenus          #
#_____________________________________________#
# CHIP                                   #
#________________________________________#
easyc.menu.chip.404=ATtiny404
easyc.menu.chip.404.build.board=AVR_ATtiny404
easyc.menu.chip.404.build.attiny=404
easyc.menu.chip.404.build.millistimer=A0
easyc.menu.chip.404.upload.maximum_size=4096
easyc.menu.chip.404.build.mrelax=
easyc.menu.chip.404.upload.maximum_data_size=256

