SolderedElectronics/Dasduino-Board-Definitions-for-Arduino-IDE/Dasduino_megaTiny_core-2.1.0/boards.txt
easyc.menu.chip.804=ATtiny804
easyc.menu.chip.804.build.board=AVR_ATtiny804
easyc.menu.chip.804.build.attiny=804
easyc.menu.chip.804.build.millistimer=A0
easyc.menu.chip.804.upload.maximum_size=8192
easyc.menu.chip.804.build.mrelax=
easyc.menu.chip.804.upload.maximum_data_size=512

easyc.menu.chip.1604=ATtiny1604
easyc.menu.chip.1604.build.board=AVR_ATtiny1604
easyc.menu.chip.1604.build.attiny=1604
easyc.menu.chip.1604.build.millistimer=A0
easyc.menu.chip.1604.upload.maximum_size=16384
easyc.menu.chip.1604.upload.maximum_data_size=1024

#----------------------------------------#
# CLOCK SOURCE                           #
#________________________________________#
easyc.menu.clock.20internal=20 MHz internal
easyc.menu.clock.16internal=16 MHz internal
easyc.menu.clock.10internal=10 MHz internal
easyc.menu.clock.8internal=8 MHz internal
easyc.menu.clock.5internal=5 MHz internal
easyc.menu.clock.4internal=4 MHz internal
easyc.menu.clock.2internal=2 MHz internal
easyc.menu.clock.1internal=1 MHz internal
easyc.menu.clock.20internaltuned=20 MHz internal - tuned
easyc.menu.clock.16internaltuned=16 MHz internal - tuned
easyc.menu.clock.12internaltuned=12 MHz internal - tuned
easyc.menu.clock.10internaltuned=10 MHz internal - tuned
easyc.menu.clock.8internaltuned=8 MHz internal - tuned
easyc.menu.clock.6internaltuned=6 MHz internal - tuned
easyc.menu.clock.5internaltuned=5 MHz internal - tuned
easyc.menu.clock.4internaltuned=4 MHz internal - tuned
easyc.menu.clock.1internaltuned=1 MHz internal - tuned
easyc.menu.clock.20extclock=20 MHz external clock
easyc.menu.clock.16extclock=16 MHz external clock
easyc.menu.clock.12extclock=12 MHz external clock
easyc.menu.clock.10extclock=10 MHz external clock
easyc.menu.clock.8extclock=8 MHz external clock
easyc.menu.clock.24internaltuned=24 MHz internal - tuned, overclocked
easyc.menu.clock.25internaltuned=25 MHz internal - tuned, overclocked
easyc.menu.clock.30internaltuned=30 MHz internal - tuned, overclocked, may be unstable, req. 20 MHz fuse
easyc.menu.clock.32internaltuned=32 MHz internal - tuned, 2-series, overclocked, may be unstable, req. 20 MHz fuse
easyc.menu.clock.24extclock=24 MHz external clock - overclocked
easyc.menu.clock.25extclock=25 MHz external clock - overclocked
easyc.menu.clock.30extclock=30 MHz external clock - overclocked, may be unstable
easyc.menu.clock.32extclock=32 MHz external clock - overclocked, may be unstable
easyc.menu.clock.20internal.build.speed=20
easyc.menu.clock.20internal.build.clocksource=0
easyc.menu.clock.16internal.build.speed=16
easyc.menu.clock.16internal.build.clocksource=0
easyc.menu.clock.10internal.build.speed=10
easyc.menu.clock.10internal.build.clocksource=0
easyc.menu.clock.8internal.build.speed=8
easyc.menu.clock.8internal.build.clocksource=0
easyc.menu.clock.5internal.build.speed=5
easyc.menu.clock.5internal.build.clocksource=0
easyc.menu.clock.4internal.build.speed=4
easyc.menu.clock.4internal.build.clocksource=0
easyc.menu.clock.2internal.build.speed=2
easyc.menu.clock.2internal.build.clocksource=0
easyc.menu.clock.1internal.build.speed=1
easyc.menu.clock.1internal.build.clocksource=0
easyc.menu.clock.20extclock.build.speed=20
easyc.menu.clock.20extclock.build.clocksource=2
easyc.menu.clock.16extclock.build.speed=16
easyc.menu.clock.16extclock.build.clocksource=2
easyc.menu.clock.12extclock.build.speed=12
easyc.menu.clock.12extclock.build.clocksource=2
easyc.menu.clock.10extclock.build.speed=10
easyc.menu.clock.10extclock.build.clocksource=2
easyc.menu.clock.8extclock.build.speed=8
easyc.menu.clock.8extclock.build.clocksource=2
easyc.menu.clock.24extclock.build.speed=24
easyc.menu.clock.24extclock.build.clocksource=2
easyc.menu.clock.25extclock.build.speed=24
easyc.menu.clock.25extclock.build.clocksource=2
easyc.menu.clock.30extclock.build.speed=30
easyc.menu.clock.30extclock.build.clocksource=2
easyc.menu.clock.32extclock.build.speed=32
easyc.menu.clock.32extclock.build.clocksource=2
easyc.menu.clock.20internaltuned.build.speed=20
easyc.menu.clock.20internaltuned.build.clocksource=0
easyc.menu.clock.20internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
easyc.menu.clock.16internaltuned.build.speed=16
easyc.menu.clock.16internaltuned.build.clocksource=0
easyc.menu.clock.16internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
easyc.menu.clock.12internaltuned.build.speed=12
easyc.menu.clock.12internaltuned.build.clocksource=0
easyc.menu.clock.12internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
easyc.menu.clock.24internaltuned.build.speed=24
easyc.menu.clock.24internaltuned.build.clocksource=0
easyc.menu.clock.24internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
easyc.menu.clock.25internaltuned.build.speed=25
easyc.menu.clock.25internaltuned.build.clocksource=0
easyc.menu.clock.25internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
easyc.menu.clock.30internaltuned.build.speed=30
easyc.menu.clock.30internaltuned.build.clocksource=0
easyc.menu.clock.30internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
easyc.menu.clock.32internaltuned.build.speed=32
easyc.menu.clock.32internaltuned.build.clocksource=0
easyc.menu.clock.32internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
easyc.menu.clock.10internaltuned.build.speed=10
easyc.menu.clock.10internaltuned.build.clocksource=0
easyc.menu.clock.10internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
easyc.menu.clock.8internaltuned.build.speed=8
easyc.menu.clock.8internaltuned.build.clocksource=0
easyc.menu.clock.8internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
easyc.menu.clock.6internaltuned.build.speed=6
easyc.menu.clock.6internaltuned.build.clocksource=0
easyc.menu.clock.6internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
easyc.menu.clock.5internaltuned.build.speed=5
easyc.menu.clock.5internaltuned.build.clocksource=0
easyc.menu.clock.5internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
easyc.menu.clock.4internaltuned.build.speed=4
easyc.menu.clock.4internaltuned.build.clocksource=0
easyc.menu.clock.4internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
easyc.menu.clock.1internaltuned.build.speed=1
easyc.menu.clock.1internaltuned.build.clocksource=0
easyc.menu.clock.1internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
easyc.menu.clock.20internaltuned.bootloader.OSCCFG=0x02
easyc.menu.clock.12internaltuned.bootloader.OSCCFG=0x02
easyc.menu.clock.10internaltuned.bootloader.OSCCFG=0x02
easyc.menu.clock.6internaltuned.bootloader.OSCCFG=0x02
easyc.menu.clock.5internaltuned.bootloader.OSCCFG=0x02
easyc.menu.clock.24internaltuned.bootloader.OSCCFG=0x02
easyc.menu.clock.25internaltuned.bootloader.OSCCFG=0x02
easyc.menu.clock.30internaltuned.bootloader.OSCCFG=0x02
easyc.menu.clock.32internaltuned.bootloader.OSCCFG=0x02
easyc.menu.clock.20internal.bootloader.OSCCFG=0x02
easyc.menu.clock.10internal.bootloader.OSCCFG=0x02
easyc.menu.clock.5internal.bootloader.OSCCFG=0x02

