SolderedElectronics/Dasduino-Board-Definitions-for-Arduino-IDE/Dasduino_megaTiny_core-2.1.0/boards.txt
#----------------------------------------#
# BOD VOLTAGE                            #
#________________________________________#
easyc.menu.bodvoltage.1v8=1.8V (5 MHz or less)
easyc.menu.bodvoltage.2v6=2.6V (10 MHz or less)
easyc.menu.bodvoltage.4v2=4.2V (20 MHZ or less)
easyc.menu.bodvoltage.2v1=2.1V (Unofficial)
easyc.menu.bodvoltage.2v9=2.9V (Unofficial)
easyc.menu.bodvoltage.3v3=3.3V (Unofficial)
easyc.menu.bodvoltage.3v7=3.7V (Unofficial)
easyc.menu.bodvoltage.4v0=4.0V (Unofficial)
easyc.menu.bodvoltage.1v8.bootloader.bodlevbits=000
easyc.menu.bodvoltage.2v1.bootloader.bodlevbits=001
easyc.menu.bodvoltage.2v6.bootloader.bodlevbits=010
easyc.menu.bodvoltage.2v9.bootloader.bodlevbits=011
easyc.menu.bodvoltage.3v3.bootloader.bodlevbits=100
easyc.menu.bodvoltage.3v7.bootloader.bodlevbits=101
easyc.menu.bodvoltage.4v0.bootloader.bodlevbits=110
easyc.menu.bodvoltage.4v2.bootloader.bodlevbits=111

#----------------------------------------#
# BOD MODE                               #
#________________________________________#
easyc.menu.bodmode.disabled=Disabled/Disabled
easyc.menu.bodmode.enabled=Enabled/Enabled
easyc.menu.bodmode.ensampfast=Enabled/Sampled (1 kHz)
easyc.menu.bodmode.ensampslow=Enabled/Sampled (125 Hz)
easyc.menu.bodmode.sampledfast=Sampled/Sampled (1 kHz)
easyc.menu.bodmode.sampledslow=Sampled/Sampled (125 Hz)
easyc.menu.bodmode.sampdisfast=Sampled/Disabled (1 kHz)
easyc.menu.bodmode.sampdisslow=Sampled/Disabled (125 Hz)
easyc.menu.bodmode.endisholdwake=Enabled hold wakeup/Disabled
easyc.menu.bodmode.disabled.bootloader.BODCFG=0x00
easyc.menu.bodmode.enabled.bootloader.bodmodebits=00101
easyc.menu.bodmode.ensampfast.bootloader.bodmodebits=00110
easyc.menu.bodmode.ensampslow.bootloader.bodmodebits=10110
easyc.menu.bodmode.sampledfast.bootloader.bodmodebits=01010
easyc.menu.bodmode.sampledlow.bootloader.bodmodebits=11010
easyc.menu.bodmode.sampdisfast.bootloader.bodmodebits=01000
easyc.menu.bodmode.sampdisslow.bootloader.bodmodebits=11000
easyc.menu.bodmode.endisholdwake.bootloader.bodmodebits=01100

#----------------------------------------#
# EEPROM RETAIN                          #
#________________________________________#
easyc.menu.eesave.enable=EEPROM retained
easyc.menu.eesave.enable.bootloader.eesavebit=1
easyc.menu.eesave.disable=EEPROM not retained
easyc.menu.eesave.disable.bootloader.eesavebit=0

#----------------------------------------#
# MILLIS TIMER                           #
#________________________________________#
easyc.menu.millis.enabled=Enabled (default timer)
easyc.menu.millis.disabled=Disabled (saves flash)
easyc.menu.millis.timera=TCA0 (default on 0-series)
easyc.menu.millis.timerd=TCD0 (1-series only, default there)
easyc.menu.millis.timerb0=TCB0 (breaks tone() and Servo)
easyc.menu.millis.timerb1=TCB1 (1614, 2-series only)
easyc.menu.millis.rtc=RTC (no micros)
easyc.menu.millis.rtcxtal=RTC w/w32.768 kHz ext. crystal (1/2-series only, no micros)
easyc.menu.millis.rtcxosc=RTC w/w32.768 kHz ext. oscillator (1/2-series only no micros)
easyc.menu.millis.disabled.build.millistimer=NONE
easyc.menu.millis.timera.build.millistimer=A0
easyc.menu.millis.timerd.build.millistimer=D0
easyc.menu.millis.timerb0.build.millistimer=B0
easyc.menu.millis.timerb1.build.millistimer=B1
easyc.menu.millis.rtc.build.millistimer=RTC
easyc.menu.millis.rtcxtal.build.millistimer=RTC_XTAL
easyc.menu.millis.rtcxosc.build.millistimer=RTC_XOSC

#----------------------------------------#
# UPDI/RESET PIN CONFIGURATION           #
#________________________________________#
#Expert mode - if you understand what these mean, uncomment them to enable.
#there are a few lines like this in platform.txt too that can be uncommented to enable for uploads, not just when burning bootloader
#easyc.menu.resetpin.UPDI=UPDI (no reset pin)
#easyc.menu.resetpin.UPDI.bootloader.resetpinbits=01
#easyc.menu.resetpin.reset=Reset (DANGER - Bricks chip w/out HV UPDI programmer!)
#easyc.menu.resetpin.reset.bootloader.resetpinbits=10
#easyc.menu.resetpin.gpio=GPIO (DANGER - Bricks chip w/out HV UPDI programmer - Use PCHV)
#easyc.menu.resetpin.gpio.bootloader.resetpinbits=00

#----------------------------------------#
# STARTUP TIME (SUT)                     #
#________________________________________#
easyc.menu.startuptime.8=8ms
easyc.menu.startuptime.0=0ms
easyc.menu.startuptime.1=1ms
easyc.menu.startuptime.2=2ms
easyc.menu.startuptime.4=4ms
easyc.menu.startuptime.16=16ms
easyc.menu.startuptime.32=32ms
easyc.menu.startuptime.64=64ms
easyc.menu.startuptime.0.bootloader.SYSCFG1=0x00
easyc.menu.startuptime.1.bootloader.SYSCFG1=0x01
easyc.menu.startuptime.2.bootloader.SYSCFG1=0x02
easyc.menu.startuptime.4.bootloader.SYSCFG1=0x03
easyc.menu.startuptime.8.bootloader.SYSCFG1=0x04
easyc.menu.startuptime.16.bootloader.SYSCFG1=0x05
easyc.menu.startuptime.32.bootloader.SYSCFG1=0x06
easyc.menu.startuptime.64.bootloader.SYSCFG1=0x07

#----------------------------------------#
# OPTIMIZATION OPTIONS                   #
#________________________________________#
#easyc.menu.optimization.size=-Os (size)
#easyc.menu.optimization.sizegcse=-Os (size, no GCSE)
#easyc.menu.optimization.o3=-O3 (speed)
#easyc.menu.optimization.o3gcse=-O3 (speed, no GCSE)
#easyc.menu.optimization.size.build.optimizationlevel=-Os
#easyc.menu.optimization.sizegcse.build.optimizationlevel=-Os
#easyc.menu.optimization.o3.build.optimizationlevel=-O3
#easyc.menu.optimization.o3gcse.build.optimizationlevel=-O3
#easyc.menu.optimization.size.build.optabr=.Os
#easyc.menu.optimization.sizegcse.build.optabr=.Osng
#easyc.menu.optimization.o3.build.optabr=.O3
#easyc.menu.optimization.o3gcse.build.optabr=.O3ng
#easyc.menu.optimization.sizegcse.build.gcse=-fno-gcse
#easyc.menu.optimization.o3gcse.build.gcse=-fno-gcse

#----------------------------------------#
# TWI OPTIONS                            #
#________________________________________#
easyc.menu.wiremode.mors=Master or Slave (saves flash and RAM)
easyc.menu.wiremode.mors.build.wire=MORS
easyc.menu.wiremode.mands=Master and Slave
easyc.menu.wiremode.mands.build.wire=MANDS

