SolderedElectronics/Dasduino-Board-Definitions-for-Arduino-IDE/Dasduino_megaTiny_core-2.1.0/boards.txt
#----------------------------------------#
# printf() version options               #
#________________________________________#
easyc.menu.printf.default=Default (doesn't print floats, 1.4k flash use)
easyc.menu.printf.full=Full, 2.6k, prints floats
easyc.menu.printf.full.build.printf=-Wl,-u,vfprintf -lprintf_flt
easyc.menu.printf.full.build.printfabr=.pfF
easyc.menu.printf.minimal=Minimal, 1.1k flash used
easyc.menu.printf.minimal.build.printf=-Wl,-u,vfprintf -lprintf_min
easyc.menu.printf.minimal.build.printfabr=.pfM

#----------------------------------------#
# PWM Pinning options                    #
#________________________________________#
easyc.menu.PWMmux.default=PB0-2, PA3-5 (default)
easyc.menu.PWMmux.D_buffered=PB0-2 (buffered), 1-series: PA4/5
easyc.menu.PWMmux.buffered=PB0-2 (buffered). No TCD PWM even on 1-series.
easyc.menu.PWMmux.I6=PB3-5, PA3-5. No TCD PWM even on 1-series.
easyc.menu.PWMmux.I3_D=PB3-5 (buffered), 1-series: PA4/5
easyc.menu.PWMmux.I3=PB3-5 (buffered). No TCD PWM even on 1-series.
easyc.menu.PWMmux.D_buffered.build.pwmflags=-DUSE_TIMERD0_PWM -DTCD_USE_WOAB -DTCA_BUFFERED_3PIN
easyc.menu.PWMmux.buffered.build.pwmflags=-DTCA_BUFFERED_3PIN
easyc.menu.PWMmux.I6.build.pwmflags=-DTCA_PORTMUX=0x07
easyc.menu.PWMmux.I3_D.build.pwmflags=-DTCA_PORTMUX=0x07 -DUSE_TIMERD0_PWM -DTCD_USE_WOAB -DTCA_BUFFERED_3PIN
easyc.menu.PWMmux.I3.build.pwmflags=-DTCA_PORTMUX=0x07 -DTCA_BUFFERED_3PIN
easyc.menu.PWMmux.default.build.pwmabr=6
easyc.menu.PWMmux.D_buffered.build.pwmabr=3D
easyc.menu.PWMmux.buffered.build.pwmabr=3
easyc.menu.PWMmux.I6.build.pwmabr=I6
easyc.menu.PWMmux.I3_D.build.pwmabr=I3D
easyc.menu.PWMmux.I3.build.pwmabr=I3

#----------------------------------------#
# attachInterrupt Mode                   #
#________________________________________#
easyc.menu.attach.allenabled=On all pins, with new implementation.
easyc.menu.attach.allenabled.build.attachmode=-DCORE_ATTACH_ALL
easyc.menu.attach.manual=Only enabled ports
easyc.menu.attach.manual.build.attachmode=-DCORE_ATTACH_NONE
easyc.menu.attach.oldversion=Old version, (may fix bugs)
easyc.menu.attach.oldversion.build.attachmode=-DCORE_ATTACH_OLD
easyc.menu.attach.manual.build.attachabr=.aMan
easyc.menu.attach.oldversion.build.attachabr=.aOld

#----------------------------------------#
# WDT MODE                               #
#________________________________________#
easyc.menu.WDTtimeout.disabled=Disabled (recommended)
easyc.menu.WDTtimeout.8seconds=Window remains open for 8 Seconds
easyc.menu.WDTtimeout.4seconds=Window remains open for 4 Seconds
easyc.menu.WDTtimeout.2seconds=Window remains open for 2 Seconds
easyc.menu.WDTtimeout.1second=Window remains open for 1 Second
easyc.menu.WDTtimeout.500msec=Window remains open for 500 milliseconds
easyc.menu.WDTtimeout.250msec=Window remains open for 250 milliseconds
easyc.menu.WDTtimeout.125msec=Window remains open for 125 milliseconds
easyc.menu.WDTwindow.disabled=No delay before window "opens"
easyc.menu.WDTwindow.8seconds=8 Second before window "opens"
easyc.menu.WDTwindow.4seconds=4 Second before window "opens"
easyc.menu.WDTwindow.2seconds=2 Second before window "opens"
easyc.menu.WDTwindow.1second=1 Second before window "opens"
easyc.menu.WDTwindow.500msec=500 millisecond before window "opens"
easyc.menu.WDTwindow.250msec=250 millisecond before window "opens"
easyc.menu.WDTwindow.125msec=125 millisecond before window "opens"
easyc.menu.WDTwindow.63msec=62.5 millisecond before window "opens"
easyc.menu.WDTtimeout.disabled.bootloader.wdttimeoutbits=0000
easyc.menu.WDTtimeout.8seconds.bootloader.wdttimeoutbits=1011
easyc.menu.WDTtimeout.4seconds.bootloader.wdttimeoutbits=1010
easyc.menu.WDTtimeout.2seconds.bootloader.wdttimeoutbits=1001
easyc.menu.WDTtimeout.1second.bootloader.wdttimeoutbits=1000
easyc.menu.WDTtimeout.500msec.bootloader.wdttimeoutbits=0111
easyc.menu.WDTtimeout.250msec.bootloader.wdttimeoutbits=0110
easyc.menu.WDTtimeout.125msec.bootloader.wdttimeoutbits=0101
easyc.menu.WDTwindow.disabled.bootloader.wdtwindowbits=0000
easyc.menu.WDTwindow.8seconds.bootloader.wdtwindowbits=1011
easyc.menu.WDTwindow.4seconds.bootloader.wdtwindowbits=1010
easyc.menu.WDTwindow.2seconds.bootloader.wdtwindowbits=1001
easyc.menu.WDTwindow.1second.bootloader.wdtwindowbits=1000
easyc.menu.WDTwindow.500msec.bootloader.wdtwindowbits=0111
easyc.menu.WDTwindow.250msec.bootloader.wdtwindowbits=0110
easyc.menu.WDTwindow.125msec.bootloader.wdtwindowbits=0101
easyc.menu.WDTwindow.63msec.bootloader.wdtwindowbits=0100